In [1]:
import numpy as np
import pandas as pd
#Read the csv file
FD=pd.read_csv("nobel_final.csv")

In [2]:
FD.describe

<bound method NDFrame.describe of           firstname    surname born_country_code died_country_code  gender  \
0    Wilhelm Conrad    Röntgen                DE                DE    male
1        Hendrik A.    Lorentz                NL                NL    male
2            Pieter     Zeeman                NL                NL    male
3             Henri  Becquerel                FR                FR    male
4            Pierre      Curie                FR                FR    male
..              ...        ...               ...               ...     ...
918           Peter     Handke                AT               NaN    male
919            Abiy  Ahmed Ali                ET               NaN    male
920         Abhijit   Banerjee                IN               NaN    male
921          Esther      Duflo                FR               NaN  female
922         Michael     Kremer                US               NaN    male

     year    category  share  \
0    1901     physics      1
1    1902     physics      2
2    1902     physics      2
3    1903     physics      2
4    1903     physics      4
..    ...         ...    ...
918  2019  literature      1
919  2019       peace      1
920  2019   economics      3
921  2019   economics      3
922  2019   economics      3

                                    name_of_university city_of_university  \
0                                    Munich University             Munich
1                                    Leiden University             Leiden
2                                 Amsterdam University          Amsterdam
3                                  École Polytechnique              Paris
4    École municipale de physique et de chimie indu...              Paris
..                                                 ...                ...
918                                                NaN                NaN
919                                                NaN                NaN
920        Massachusetts Institute of Technology (MIT)       Cambridge MA
921        Massachusetts Institute of Technology (MIT)       Cambridge MA
922                                 Harvard University       Cambridge MA

    country_of_university born_month  age  age_get_prize
0                 Germany        Mar   78             56
1         the Netherlands        Jul   75             49
2         the Netherlands        May   78             37
3                  France        Dec   56             51
4                  France        May   47             44
..                    ...        ...  ...            ...
918                   NaN        Dec   78             77
919                   NaN        Aug   44             43
920                   USA        Feb   59             58
921                   USA        Oct   48             47
922                   USA        Nov   56             55

[923 rows x 14 columns]>

In [3]:
FD.describe(include=np.object)

,firstname,surname,born_country_code,died_country_code,gender,category,name_of_university,city_of_university,country_of_university,born_month
count,923,921,923,617,923,923,697,692,693,923
unique,704,866,79,46,2,6,307,186,29,12
top,John,Smith,US,US,male,medicine,University of California,Cambridge MA,USA,Jun
freq,12,5,274,224,869,219,32,50,358,88

In [8]:
FD["category"].value_counts()

medicine      219
physics       213
chemistry     184
literature    116
peace         107
economics      84
Name: category, dtype: int64

In [11]:
FD.loc[FD["born_country_code"]=="US","gender"].value_counts()

male      262
female     12
Name: gender, dtype: int64

In [12]:
FD.loc[FD["born_country_code"]=="US","firstname"].max()

'Woodrow'